In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("/Users/mayte/GitHub/BugPlusEngine/result_logging/log_train_run_PPO_4_edges_action_clipping.csv", sep=";")

In [3]:
# gdf for successfully solved problems
df_100 = df[df['reward']==100]
df_100.head()

    index  reward                                             config
12  23368     100  [6 6 10 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...
37  10099     100  [5 7 16 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 ...
39  22846     100  [7 9 48 0 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 ...
64  47214     100  [8 6 24 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 ...
89  15685     100  [9 6 72 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...

In [4]:
# count how many times each index is in df_100
df_solved = df_100['index'].value_counts()
df_solved.head()

5295     79
22466    78
16935    78
5315     78
7272     77
Name: index, dtype: int64

In [5]:
#rename columns:
df_solved = df_solved.rename_axis('index').reset_index(name='count_100')
df_solved.head()

   index  count_100
0   5295         79
1  22466         78
2  16935         78
3   5315         78
4   7272         77

In [6]:
# merge df and df_solved
df_merged = pd.merge(df, df_solved, on='index', how='left')

In [7]:
df_merged.head()

   index  reward                                             config  count_100
0  20349     -10  [9 6 30 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...         32
1  12731     -10  [6 7 12 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...         40
2  20533     -10  [5 7 56 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...         23
3  41315     -10  [6 9 24 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...         33
4  22524     -10  [6 5 8 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 0 0 0 0...         30

In [8]:
df.reward.unique()

array([-10, 100,  -1])

In [9]:
df_minus1 = df[df['reward']==-1]
df_minus1.head()

    index  reward                                             config
14  33842      -1  [6 8 14 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...
15  33842      -1  [6 8 14 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...
16  33842      -1  [6 8 14 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...
17  33842      -1  [6 8 14 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...
18  33842      -1  [6 8 14 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...

In [10]:
df_error = df_minus1['index'].value_counts()
df_error.head()

5530     10
33211    10
14642     9
45882     9
44563     9
Name: index, dtype: int64

In [11]:
df_error = df_error.rename_axis('index').reset_index(name='count_minus1')
df_error.head()

   index  count_minus1
0   5530            10
1  33211            10
2  14642             9
3  45882             9
4  44563             9

In [12]:
# merge df and df_error
df_merged = pd.merge(df_merged, df_error, on='index', how='left')
df_merged.head()

,index,reward,config,count_100,count_minus1
0,20349,-10,[9 6 30 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...,32,2.0
1,12731,-10,[6 7 12 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...,40,1.0
2,20533,-10,[5 7 56 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...,23,NaN
3,41315,-10,[6 9 24 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...,33,2.0
4,22524,-10,[6 5 8 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 0 0 0 0...,30,NaN

In [13]:
df_minus10 = df[df['reward']==-10]
df_minus10.head()

   index  reward                                             config
0  20349     -10  [9 6 30 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...
1  12731     -10  [6 7 12 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...
2  20533     -10  [5 7 56 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...
3  41315     -10  [6 9 24 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...
4  22524     -10  [6 5 8 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 0 0 0 0...

In [14]:
df_loop = df_minus10['index'].value_counts()
df_loop.head()

2382     5
45290    5
22233    5
43033    5
24103    4
Name: index, dtype: int64

In [15]:
#rename columns:
df_loop = df_loop.rename_axis('index').reset_index(name='count_minus10')
df_loop.head()

   index  count_minus10
0   2382              5
1  45290              5
2  22233              5
3  43033              5
4  24103              4

In [16]:
df_merged = pd.merge(df_merged, df_loop, on='index', how='left')
df_merged.head()

,index,reward,config,count_100,count_minus1,count_minus10
0,20349,-10,[9 6 30 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 ...,32,2.0,1.0
1,12731,-10,[6 7 12 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...,40,1.0,2.0
2,20533,-10,[5 7 56 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...,23,NaN,2.0
3,41315,-10,[6 9 24 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 ...,33,2.0,1.0
4,22524,-10,[6 5 8 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 0 0 0 0...,30,NaN,2.0